Revit 2027 API
CableTraySizes.GetCableTraySizesIterator Method
 Returns a CableTraySizeIterator to the MEP cable tray sizes.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CableTraySizeIterator GetCableTraySizesIterator()
Public Function GetCableTraySizesIterator As CableTraySizeIterator
public:
CableTraySizeIterator^ GetCableTraySizesIterator()
member GetCableTraySizesIterator : unit -> CableTraySizeIterator
Return Value
CableTraySizeIterator
See Also
Reference
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace